Shrimpaste/2026Spring-4-Dian/Level-2(not-finishedTAT)/MP3-flash-storage/sdkconfig.defaults
# ESP32-S3 MP3 Player Default Configuration

# Target
CONFIG_IDF_TARGET="esp32s3"

# Flash size (8MB for N8R8)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# SPIFFS Configuration
CONFIG_SPIFFS_PAGE_SIZE=256
CONFIG_SPIFFS_OBJ_NAME_LEN=64
CONFIG_SPIFFS_USE_MAGIC=y
CONFIG_SPIFFS_USE_MAGIC_LENGTH=y
CONFIG_SPIFFS_META_LENGTH=4
CONFIG_SPIFFS_USE_MTIME=y

# I2S Configuration
CONFIG_I2S_ENABLE_DEBUG_LOG=n

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Main task
CONFIG_MAIN_TASK_STACK_SIZE=8192

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# ESP32-S3 specific
# PSRAM disabled for compatibility
CONFIG_ESP32S3_SPIRAM_SUPPORT=n
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# New I2S driver
CONFIG_I2S_STD_EN=y
CONFIG_I2S_SUPPORTS_ADC=n
CONFIG_I2S_SUPPORTS_ADC_DAC=n
